public/blog/windows/simulating-bad-blocks-on-ntfs-filesystems/index.html
<!DOCTYPE html>
<html lang="en">
<head>  <meta charset="UTF-8">
  <title>Simulating Bad Blocks NTFS Filesystems</title>
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="/css/gtd.css">
  
  
</head>
<body>
  
<main>
  <div style="margin: 1rem;">
    <a href="/" style="
      display: inline-block;
      background-color: #eee;
      color: #333;
      padding: 0.4rem 0.8rem;
      border-radius: 6px;
      text-decoration: none;
      font-weight: bold;
      font-family: sans-serif;
      font-size: 0.9rem;
    ">
      ← Homepage
    </a>

  <h1>Simulating Bad Blocks NTFS Filesystems</h1>

  </div>
  <nav class="toc">
    <nav id="TableOfContents">
<ul>
<li><a href="#headline-1">Simulating Bad Blocks on NTFS Filesystems</a>
<ul>
<li><a href="#headline-2">Preamble</a>
</li>
</ul>
</li>
<li><a href="#headline-3">Simulating Corruption</a>
<ul>
<li><a href="#headline-4">Creating the test environment</a>
</li>
<li><a href="#headline-5">Setting up the NTFS Volume</a>
<ul>
<li><a href="#headline-6">Creating a filesystem</a>
</li>
<li><a href="#headline-7">Output Example</a>
</li>
<li><a href="#headline-8">CHKDSK Sample Output</a>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</nav>
  </nav> 

  <article>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Simulating Bad Blocks on NTFS Filesystems
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Preamble
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>Directions for simulating a file system corruption error on an NTFS drive on a
Windows host system. This is useful when you are testing tools that require this
error exist.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Simulating Corruption
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>
https://github.com/jamersonpro/ntfsmarkbad</p>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Creating the test environment
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>
Create the folder for our demo environment</p>
<div class="src src-powershell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-powershell" data-lang="powershell"><span style="display:flex;"><span>mkdir BadBlocktest
</span></span><span style="display:flex;"><span>cd BadBlockTest</span></span></code></pre></div>
</div>
<p>
Download the NtfsMarkBad tool</p>
<div class="src src-powershell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-powershell" data-lang="powershell"><span style="display:flex;"><span>Invoke-WebRequest -Uri <span style="color:#e6db74">&#34;https://github.com/jamersonpro/ntfsmarkbad/releases/download/v0.0.2/NtfsMarkBad.exe&#34;</span> -Outfile <span style="color:#e6db74">&#34;NtfsMarkBad.exe&#34;</span> -UseBasicParsing</span></span></code></pre></div>
</div>
<p>
Create a virtual hard disk file</p>
<div class="src src-powershell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-powershell" data-lang="powershell"><span style="display:flex;"><span>New-VHD -Path <span style="color:#e6db74">&#34;BadBlocks.vhd&#34;</span> -Fixed -SizeBytes <span style="color:#ae81ff">100</span>MB
</span></span><span style="display:flex;"><span>Mount-VHD .\BadBlocks.vhd</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Setting up the NTFS Volume
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<div id="outline-container-headline-6" class="outline-4">
<h4 id="headline-6">
Creating a filesystem
</h4>
<div id="outline-text-headline-6" class="outline-text-4">
<p>Open DiskMGMT.msc. The first prompt will be to format the
drive. Select GPT and format the device using NTFS with the default
settings.</p>
<p>
Now use NtfsMarkbad.exe with the drive letter of the mounted VHD. Copy the
&#34;First Volume Sector&#34; value for later.</p>
<div class="src src-powershell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-powershell" data-lang="powershell"><span style="display:flex;"><span>./NtfsMarkbad.exe G:
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>Output<span style="color:#960050;background-color:#1e0010">:</span>
</span></span><span style="display:flex;"><span>NTFSMARKBAD <span style="color:#ae81ff">0.0</span>.2 x64     https<span style="color:#960050;background-color:#1e0010">:</span>//github.com/jamersonpro/ntfsmarkbad
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>Scanning volume...
</span></span><span style="display:flex;"><span>First volume sector<span style="color:#960050;background-color:#1e0010">:</span> <span style="color:#ae81ff">128</span> **MAKE NOTE OF THIS**
</span></span><span style="display:flex;"><span>Last volume sector<span style="color:#960050;background-color:#1e0010">:</span> <span style="color:#ae81ff">16511</span>
</span></span><span style="display:flex;"><span>Bytes per sector<span style="color:#960050;background-color:#1e0010">:</span> <span style="color:#ae81ff">512</span>
</span></span><span style="display:flex;"><span>Sectors per cluster<span style="color:#960050;background-color:#1e0010">:</span> <span style="color:#ae81ff">8</span>
</span></span><span style="display:flex;"><span>Total cluster count<span style="color:#960050;background-color:#1e0010">:</span> <span style="color:#ae81ff">2047</span>
</span></span><span style="display:flex;"><span>Completed.</span></span></code></pre></div>
</div>
<p>
These commands will create a file slightly larger than 1MB in size. Files less
than this will get stored directly in the MFT Table instead of on sectors of the
FS</p>
<div class="src src-powershell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-powershell" data-lang="powershell"><span style="display:flex;"><span>fsutil.exe file createnew G:\file.txt <span style="color:#ae81ff">1048576</span>
</span></span><span style="display:flex;"><span>fsutil.exe file queryextents G:\file.txt
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>Output<span style="color:#960050;background-color:#1e0010">:</span> VCN<span style="color:#960050;background-color:#1e0010">:</span> 0x0        Clusters<span style="color:#960050;background-color:#1e0010">:</span> 0x100      LCN<span style="color:#960050;background-color:#1e0010">:</span> 0x5c0</span></span></code></pre></div>
</div>
<p>
The NtfsMarkBad.exe software requires a range of sectors to mark as bad. Using
the data from the <code>queryextents</code> command, copy this template to mark your drive as
bad. The sections you need to replace with your own values are commented</p>
<div class="src src-powershell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-powershell" data-lang="powershell"><span style="display:flex;"><span>  $SectorsPerCluster=<span style="color:#ae81ff">8</span>
</span></span><span style="display:flex;"><span>  $FirstVolumeSector=<span style="color:#ae81ff">1000</span>
</span></span><span style="display:flex;"><span>  $VCN=[<span style="color:#66d9ef">uint32</span>]<span style="color:#e6db74">&#34;0x0&#34;</span>        <span style="color:#75715e"># Change this</span>
</span></span><span style="display:flex;"><span>  $CLUSTERS=[<span style="color:#66d9ef">uint32</span>]<span style="color:#e6db74">&#34;0x100&#34;</span> <span style="color:#75715e"># Change this</span>
</span></span><span style="display:flex;"><span>  $LCN=[<span style="color:#66d9ef">uint32</span>]<span style="color:#e6db74">&#34;0x5c0&#34;</span>      <span style="color:#75715e"># Change this</span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  $LCN = ($VCN + $LCN)
</span></span><span style="display:flex;"><span>  $StartingSector = (($LCN * $SectorsPerCluster) + $FirstVolumeSector)
</span></span><span style="display:flex;"><span>  $EndingSector = ((($LCN + $CLUSTERS <span style="color:#ae81ff">-1</span>) * $SectorsPerCluster) + $FirstVolumeSector)
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  ./NtfsMarkBad.exe G: $StartingSector $EndingSector</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-7" class="outline-4">
<h4 id="headline-7">
Output Example
</h4>
<div id="outline-text-headline-7" class="outline-text-4">
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span>PS F:\Programs\Forensics&gt;   ./NtfsMarkBad.exe D: $StartingSector $EndingSector
</span></span><span style="display:flex;"><span>NTFSMARKBAD 0.0.2 x64     https://github.com/jamersonpro/ntfsmarkbad
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>Scanning volume...
</span></span><span style="display:flex;"><span>First volume sector: 128
</span></span><span style="display:flex;"><span>Last volume sector: 200831
</span></span><span style="display:flex;"><span>Bytes per sector: 512
</span></span><span style="display:flex;"><span>Sectors per cluster: 8
</span></span><span style="display:flex;"><span>Total cluster count: 25087
</span></span><span style="display:flex;"><span>The number of clusters skipped since they already marked bad: 0
</span></span><span style="display:flex;"><span>The number of clusters skipped since they are in use: 1360
</span></span><span style="display:flex;"><span>The number of selected clusters: 108
</span></span><span style="display:flex;"><span>Adding 108 clusters to the Bad Clusters File...
</span></span><span style="display:flex;"><span>Completed.
</span></span><span style="display:flex;"><span>PS F:\Programs\Forensics&gt;</span></span></code></pre></div>
</div>
<p>
PS C:\Users\Peter\Downloads&gt;   ./NtfsMarkBad.exe G: $StartingSector $EndingSector
NTFSMARKBAD 0.0.2 x64     <a href="https://github.com/jamersonpro/ntfsmarkbad">https://github.com/jamersonpro/ntfsmarkbad</a></p>
<p>
Scanning volume…
First volume sector: 128
Last volume sector: 16511
Bytes per sector: 512
Sectors per cluster: 8
Total cluster count: 2047
The number of clusters skipped since they already marked bad: 0
The number of clusters skipped since they are in use: 131
The number of selected clusters: 0
No clusters to add to the Bad Clusters File.</p>
</div>
</div>
<div id="outline-container-headline-8" class="outline-4">
<h4 id="headline-8">
CHKDSK Sample Output
</h4>
<div id="outline-text-headline-8" class="outline-text-4">
<div class="src src-powershell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-powershell" data-lang="powershell"><span style="display:flex;"><span>PS C:\Users\Peter\BadBlocksTest&gt; chkdsk /f G:
</span></span><span style="display:flex;"><span>The type of the file system is NTFS.
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>Chkdsk cannot run because the volume is <span style="color:#66d9ef">in</span> use by another
</span></span><span style="display:flex;"><span><span style="color:#66d9ef">process</span>.  Chkdsk may run <span style="color:#66d9ef">if</span> this volume is dismounted first.
</span></span><span style="display:flex;"><span>ALL OPENED HANDLES TO THIS VOLUME WOULD THEN BE INVALID.
</span></span><span style="display:flex;"><span>Would you like to force a dismount on this volume? (Y/N)</span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  </article>
</main>

</body>
</html>
